Repository: rmraya/TMXEditor
Catalog: docs/i18n/tmxeditor_fr.ditamap.xlf.tmx
Source language: en
Languages: fr

source: Editing an Existing File
fr: Éditer un fichier TMX existant

source: In main menu, select File Open option ([ Ctrl+O ] on Windows/Linux, [ Cmd+O ] on macOS) or click the Open button on the top toolbar.
fr: Dans le menu, sélectionnez Fichier Ouvrir ([ Ctrl+O ] sur Windows/Linux, [ Cmd+O ] sur macOS), ou cliquez sur le bouton Ouvrir dans la barre d’outils.

source: Select Edit Delete Selected Units in main menu or click the Delete Selected Units button on the top toolbar.
fr: Sélectionnez Edition Supprimer les unités sélectionnées dans le menu, ou cliquez sur le bouton Supprimer les unités sélectionnées dans la barre d’outils.

source: You can use the top-left checkbox to select/deselect all units at once.
fr: Pour sélectionner ou désélectionner toutes les unités de traductions du fichier, cochez la case en haut à gauche.

source: Use the Filter Translation Units option to locate text in the file.
fr: Filtrer les unités de traduction pour effectuer une recherche de texte dans le fichier.

source: Use the Sort Translation Units option to display file entries sorted on a selected language.
fr: Trier les unités de traduction pour afficher les unités de traduction selon une des langues du fichier.

source: After making changes to the TMX file, select File Save in main menu ([ Ctrl+S ] on Windows/Linux, [ Cmd+S ] on macOS) or click the Save button on the top toolbar to save your modifications.
fr: Pour enregistrer vos modifications dans le fichier TMX, sélectionnez Fichier Enregistrer dans le menu ([ Ctrl+S ] sur Windows/Linux, [ Cmd+S ] sur macOS), ou cliquez sur le bouton Enregistrer dans la barre d’outils.

source: Use the dialog that appears to select a TMX file from the file system.
fr: À l’aide de la boîte de dialogue qui apparaît, sélectionnez dans le système de fichiers le fichier TMX à ouvrir.

source: Once the selected TMX file is open, you can:
fr: Une fois le fichier ouvert, vous pouvez :

source: Click on any text cell to begin editing. After making changes, you can either
fr: Modifier le texte d’une cellule en cliquant dedans. Quand la saisie est terminée,

source: Click outside the cell or press [ Alt+Enter ] to save your changes
fr: cliquez en dehors de la cellule ou appuyez sur [ Alt+Entrée ] pour enregistrer la modification,

source: Press the [ ESC ] key to cancel your changes
fr: ou appuyez sur la touche [ Échap ] pour abandonner la modification.

source: To add new units to the TMX file, select Edit Insert Translation Unit in main menu or click the Insert Translation Unit button from the top toolbar.
fr: Ajouter une nouvelle unité de traduction, en sélectionnant Édition Ajouter une unité de traduction dans le menu, ou en cliquant sur le bouton Ajouter une unité de traduction dans la barre d’outils.

source: To delete one or more units:
fr: Effacer une ou plusieurs unités de traduction de la façon suivante :

source: Select the checkbox in the leftmost column of the editing window to mark the units that you want to remove
fr: Sélectionnez les unités de traduction à supprimer en cochant les cases correspondantes dans la colonne de gauche.

source: Translation Memory eXchange (TMX) is an open standard originally published by LISA (Localization Industry Standards Association). The purpose of TMX is to allow easier exchange of translation memory data between tools and/or translation vendors with little or no loss of critical data during the process.
fr: Translation Memory eXchange (TMX) est un format ouvert développé à l’origine par LISA (Localization Industry Standards Association). L’objectif de ce format de faciliter l’échange de mémoires de traduction entre différents outils et/ou prestataires de traduction, en évitant autant que possible les pertes de données importantes en cours de route.

source: Character Set
fr: Jeu de caractères

source: A character set (sometimes referred to as code page) is a collection of characters that are associated with a sequence of natural numbers in order to facilitate the storage of text in computers and the transmission of text through telecommunication networks.
fr: Un jeu de caractères (parfois appelé page de code) est un ensemble de caractères qui sont associés à une séquence de nombres naturels afin de faciliter le stockage de texte dans les ordinateurs ainsi que leur transmission par les réseaux de télécommunication.

source: Language Code
fr: Code de langue

source: A language code is a code that assigns letters or numbers as identifiers or classifiers for languages. Language codes used in TMX files must comply with the rules defined by BCP 47 - Tags for Identifying Languages
fr: Un code de langue est une convention attribuant des codes alphanumériques aux langues et aux variétés régionales pour les identifier. Dans le fichiers TMX, les codes utilisés pour les langues doivent être ceux de la norme BCP 47 - Étiquettes pour identifier les langues

source: Source Language
fr: Langue source

source: The language of a document that is to be translated.
fr: Langue du document à traduire.

source: Subscription Key
fr: Clé d’abonnement

source: A Subscription key is a short text code that lets you register and use a software program during a pre-established time period.
fr: Une clé d’abonnement est un code permettant de s’inscrire et d’utiliser un programme pendant une période donnée.

source: Translation Memory
fr: Mémoire de traduction

source: Translation Memory (TM) is a language technology that enables the translation of segments (paragraphs, sentences or phrases) of documents by searching for similar segments in a database and suggesting matches that are found in the databases as possible translations.
fr: La mémoire de traduction est une technologie linguistique qui permet de traduire des segments (paragraphes, phrases ou expressions) de documents en recherchant des segments similaires dans une base de données, puis en proposant les correspondances trouvées.

source: Translation Unit
fr: Unité de traduction

source: A translation unit (represented by the <tu> element in a TMX file) contains a piece of source text and optional translation and metadata related to that piece of text.
fr: Une unité de traduction (représentée par la balise <tu> dans un fichier TMX) contient un fragment de texte source, souvent accompagné de sa traduction dans une ou plusieurs langues et de métadonnées associées.

source: Add Language
fr: Ajouter une langue

source: Follow these steps to add a language to a TMX file.
fr: Voici les étapes à suivre pour ajouter une langue (et une colonne vide) dans un fichier TMX

source: Open the TMX file that you want to modify.
fr: Ouvrez le fichier TMX à nettoyer.

source: In main menu, select Tasks Add Language... .
fr: Dans le menu, sélectionnez Tâches Ajouter une langue .

source: The following dialog appears:
fr: La boîte de dialogue "Découper un fichier TMX" s’ouvre :

source: Add Language Dialog
fr: Boîte de dialogue "Ajouter une langue"

source: Use the drop-down box to select the language to add.
fr: Sélectionnez la langue à ajouter à l’aide de la liste déroulante.

source: Click the Add Language button.
fr: Cliquez sur le bouton Ajouter la langue .

source: The dialog closes and the editing window is refreshed to reflect the changes.
fr: La boîte de dialogue se ferme et la colonne de la langue supprimée disparaît dans la fenêtre principale.

source: Change Language
fr: Modifier une langue

source: Follows these steps to change a language code used in a TMX file
fr: Marche à suivre pour modifier le code d’une langue dans un fichier TMX.

source: Click the Change Language button.
fr: Cliquez sur le bouton Modifier la langue .

source: Most Translation Memory (TM) systems are sensitive to language codes . A TM system may normally consider that the code "en" (English) is different from "en-US" (English for the United States) or "en-GB" (English for the United Kingdom)
fr: En général, les systèmes à mémoire de traduction sont pointilleux sur les codes de langue . Ils peuvent par exemple considérer que le code "en" (anglais) diffère du code "en-US" (anglais américain) et du code "en-GB" (anglais britannique).

source: TMXEditor allows you to change the language codes used in a TMX file.
fr: TMXEditor permet de changer le code des langues présentes dans un fichier TMX.

source: In main menu, select Tasks Change Language... .
fr: Dans le menu, sélectionnez Tâches Modifier une langue. .

source: Change Language Dialog
fr: Boîte de dialogue "Modifier une langue"

source: Use the Current Language drop-down box to select the language that you want to change.
fr: Sélectionnez la langue à modifier à l’aide de la liste déroulante Langue à modifier .

source: Use the New Language drop-down box to select the new language.
fr: Sélectionnez la nouvelle langue à appliquer à l’aide de la liste déroulante Nouvelle langue .

source: Change Source Language
fr: Changer de langue source

source: Follow the steps to change the source language of a TMX file.
fr: Marche à suivre pour modifier la langue source d’un fichier TMX

source: Click the Change Source Language button.
fr: Cliquez sur le bouton Changer la langue source .

source: Some Translation Memory systems use bilingual TMX files and translate in only one direction.
fr: Certains systèmes à mémoire de traduction utilisent des fichiers TMX bilingues et ne traduisent que dans un sens.

source: Use this option to select the source language of your TMX file for systems that cannot translate in any direction.
fr: Afin de contourner les limitations de ces systèmes, TMXEditor permet de sélectionner dans un fichier TMX la langue qui doit être considérée comme la langue source .

source: In main menu, select Tasks Change Source Language... option.
fr: Dans le menu, sélectionnez Tâches Changer de langue source .

source: Change Source Language Dialog
fr: Boîte de dialogue "Changer de langue source"

source: Use the Language drop-down box to select the new source language.
fr: Sélectionnez la nouvelle langue source à l’aide de la liste déroulante Langue .

source: The Language drop-down control includes Any Language as first entry. Use this option to indicate that the file can be used in any direction.
fr: La première valeur dans la liste Langue est N’importe laquelle . Choisissez cette valeur pour indiquer que le fichier est utilisable dans tous les sens de traduction.

source: Conversion Tasks
fr: Tâches de conversion

source: TMXEditor can perform the following conversions:
fr: TMXEditor peut effectuer les tâches de conversion suivantes :

source: Convert Excel File to TMX
fr: Convertir un fichier Excel en TMX

source: Export TMX as Excel File
fr: Exporter un fichier TMX en fichier Excel

source: Convert CSV/TAB Delimited File to TMX
fr: Convertir un fichier CSV ou TSV en TMX

source: Export TMX as TAB Delimited File
fr: Exporter un fichier TMX en fichier TSV (séparateur Tab)

source: Convert SDLTM File to TMX
fr: Convertir un fichier SDLTM en TMX

source: Convert TBX File to TMX
fr: Convertir un fichier TBX en TMX

source: Prefer Excel files over CSV/TAB delimited when your data contains multiple lines of text in a single cell or translation unit.
fr: Le format Excel est plus performant que les formats CSV ou TSV lorsque les cellules ou unités de traduction contiennent plusieurs lignes de texte.

source: Clean Invalid Characters
fr: Supprimer les caractères invalides

source: Follow these steps to remove invalid characters from a TMX file.
fr: Marche à suivre pour supprimer les caractères invalides d’un fichier TMX.

source: TMX is an XML-based vocabulary and thereafter a TMX file must not contain characters not allowed by the XML standard.
fr: Comme le format TMX est basé sur la syntaxe XML, les fichiers TMX ne doivent pas contenir des caractères que la norme XML interdit.

source: A TMX file that contains invalid characters cannot be edited without removing those characters first.
fr: Un fichier TMX contenant des caractères invalides doit être nettoyé pour devenir éditable.

source: In main menu, select File Clean Invalid Characters... .
fr: Dans le menu, sélectionnez Fichier Supprimer les caractères invalides .

source: Use the dialog that appears to locate and select the file that you want to repair.
fr: Sélectionnez le fichier à réparer à l’aide de la boîte de dialogue.

source: A progress indicator is displayed while the selected file is cleaned and a backup of the original data is saved in the same folder.
fr: Un petit message s’affiche pendant le traitement. Une sauvegarde du fichier original est conservée à côté du fichier traité.

source: Consolidate Translation Units
fr: Consolider les unités de traduction

source: Follow these steps to consolidate units in a TMX file with three or more languages.
fr: Marche à suivre pour consolider les unités de traduction dans un fichier TMX contenant au moins trois langues.

source: Use the Source Language drop-down to select the language to be considered source language for merging units (it may differ from the source language set at file level).
fr: À l’aide de la liste déroulante Langue source , sélectionnez la langue devant être considérée comme la langue source lors du regroupement des unités de traduction. (Cette langue n’est pas forcément la même que la langue source définie au niveau du fichier.)

source: Click the Consolidate Units button.
fr: Cliquez sur le bouton Consolider .

source: A progress indicator is displayed while units are consolidated. The editing window is refreshed to reflect the changes.
fr: Un petit message s’affiche pendant le traitement. Les données du fichier consolidé apparaissent dans la fenêtre principale.

source: In files with three or more languages, it is possible that translations of a given source text into different languages appear in different translation units, as illustrated by the following image.
fr: Dans les fichiers contenant trois langues ou plus, il arrive que les traductions dans différentes langues d’un même segment source soient réparties dans des unités de traduction distinctes, comme sur l’image ci-dessous.

source: Needs Consolidation Example
fr: Unités de traduction avant consolidation

source: Consolidating units puts all related translations in the same unit. The following image shows the consolidated version of the one above.
fr: La consolidation consiste à regrouper toutes les traductions qui vont ensemble. Une fois consolidés, les 5 segments de l’image précédente n’en forment plus que 3.

source: Consolidated Units Example
fr: Unités de traduction après consolidation

source: Open the TMX file that you want to consolidate.
fr: Ouvrez le fichier TMX à consolider.

source: In main menu, select Tasks Consolidate Units... .
fr: Dans le menu, sélectionnez Tâches Consolider les unités de traduction. .

source: Consolidate Units Dialog
fr: Boîte de dialogue "Consolider les unités de traduction"

source: Create TMX File
fr: Créer un fichier TMX

source: Follow these steps to create a new TMX file.
fr: Voici les étapes à suivre pour créer un fichier TMX

source: Edit cells as explained in Editing an Existing File section.
fr: Éditez les cellules comme expliqué au chapitre Éditer un fichier existant .

source: To save the changes made to the file, select File Save option ([ Ctrl+S ] on Windows/Linux, [ Cmd+S ] on macOS) in main menu, or click the Save button on the top toolbar.
fr: Pour enregistrer le fichier TMX, sélectionnez Fichier Enregistrer ([ Ctrl+S ] sur Windows/Linux, [ Cmd+S ] sur macOS) dans le menu, ou cliquez sur le bouton Enregistrer dans la barre d’outils.

source: Use the dialog that appears to indicate the name and location where the new TMX file will be saved.
fr: Dans la boîte de dialogue qui s’ouvre, indiquez l’emplacement et le nom du fichier à enregistrer.

source: In main menu, select File New option ([ Ctrl+N ] on Windows/Linux, [ Cmd+N ] on macOS) or click the New button from the top toolbar.
fr: Dans le menu, sélectionnez Fichier Créer un fichier ([ Ctrl+N ] sur Windows/Linux, [ Cmd+N ] sur macOS), ou cliquez sur le bouton Créer un fichier dans la barre d’outils.

source: New TMX File Dialog
fr: Boîte de dialogue "Créer un fichier TMX"

source: Use the Source Language drop-down to select the language of source text.
fr: Sélectionnez la langue de départ à l’aide de la liste déroulante Langue source .

source: Use the Target Language drop-down to select the target language.
fr: Sélectionnez la langue d’arrivée à l’aide de la liste déroulante Langue cible .

source: Click the Create TMX File button.
fr: Cliquez sur le bouton Créer le fichier .

source: A new file is displayed in the editing window.
fr: Le fichier créé s’affiche immédiatement dans la fenêtre principale.

source: To add new entries, click on the Insert Translation Unit button on the top toolbar, or select Edit Insert Translation Unit in main menu.
fr: Commencez à saisir des données en cliquant sur le bouton Ajouter une unité de traduction dans la barre d’outils, ou en sélectionnant Édition Ajouter une unité de traduction dans le menu.

source: Follow these steps to convert a TMX file to an Excel spreadsheet.
fr: Marche à suivre pour convertir un fichier TMX en une feuille Excel.

source: Microsoft Excel files provide a common way to exchange tabular data. TMXEditor is able to export TMX text data, without inline tags, to .xlsx files.
fr: Les fichiers Microsoft Excel sont couramment utilisés pour échanger des tableaux de données. TMXEditor permet d’exporter des données TMX (sans les balises inline) dans un fichier .xlsx .

source: An Excel worksheet on Office 365 and newer versions of Microsoft Office such as Excel 2019, 2016, 2013, 2010 and 2007 can contain maximum 1,048,576 rows and 16,384 columns. Older versions contained a limit of maximum 65,536 rows and 256 columns.
fr: Avec Office 365 et les versions récentes de Microsoft Office (à partir de 2007), une feuille Excel peut contenir jusqu’à 1 048 576 lignes et 16 384 colonnes. Dans les versions plus anciennes d’Excel, les feuilles de calcul sont limitées à 65 536 lignes et 256 colonnes.

source: Open the TMX file that you want to export.
fr: Ouvrez le fichier TMX à exporter.

source: In main menu, select File Export as Excel File... .
fr: Dans le menu, sélectionnez Fichier Exporter en fichier Excel .

source: Use the dialog that appears to locate and select the generated Excel file.
fr: Définissez le nom et l’emplacement du fichier à générer à l’aide de la boîte de dialogue.

source: Export as TAB Delimited File
fr: Exporter un fichier TMX en fichier TSV (séparateur Tab)

source: Follow these steps to convert a TMX file to TAB delimited format that can be reviewed using Microsoft Excel or similar applications.
fr: Marche à suivre pour convertir un fichier TMX en un format tabulaire (séparateur Tab) lisible par Microsoft Excel et les autres tableurs.

source: Tab-delimited files are plain text files used for storing data in a tabular structure, e.g., database table or spreadsheet data, and a way of exchanging information between databases. Each record in the table is one line of the text file and entries are separateed by a TAB character.
fr: Les fichiers TSV (Tab-Separated Values) sont des fichiers texte brut contenant des données tabulaires (tables de bases de données, feuilles de calcul...). Ils sont notamment utilisés pour échanger des données d’une base de données à l’autre. Chaque ligne du fichier contient un enregistrement de la table, les champs étant séparés les uns des autres par le caractère Tab.

source: In main menu, select File Export as TAB Delimited File... .
fr: Dans le menu, sélectionnez Fichier Exporter en fichier TSV .

source: Use the dialog that appears to locate and select the file where to save the TAB delimited version.
fr: Définissez le nom et l’emplacement du fichier à générer à l’aide de la boîte de dialogue.

source: A progress indicator is displayed while the file is exported as TAB delimited using Microsoft Excel standard settings (UTF-16LE character set , TAB as column separator and no text delimiters).
fr: Un petit message s’affiche pendant le traitement. Le fichier TSV généré est conforme au format standard d’Excel ( jeu de caractères UTF-16LE, séparateur Tab pour les colonnes, sans délimiteur de texte).

source: Set File Level Metadata
fr: Définir les métadonnées d’un fichier TMX

source: The <header> element of a TMX document stores information about the file in three containers:
fr: Dans l’en-tête d’un fichier TMX (balise <header> ), on trouve trois types d’informations propres au fichier :

source: File Level Properties
fr: Propriétés du fichier

source: To edit file-level properties, click on the Properties tab of the File Properties dialog. The dialog displays this view:
fr: Dans la boîte de dialogue Métadonnées du fichier , cliquez sur l’onglet Propriétés pour accéder aux propriétés du fichier. La boîte de dialogue affiche alors les propriétés du fichier.

source: File Properties Dialog
fr: Boîte de dialogue "Métadonnées du fichier"

source: Click the Add Property button to open a dialog for entering the type and value of the new property to be added.
fr: Pour ajouter une propriété, cliquez sur le bouton Ajouter une propriété , puis saisissez le type et la valeur de la propriété à ajouter.

source: If you want to remove properties from the list, click the corresponding Remove Property buttons ( ) on the leftmost column.
fr: Pour supprimer une propriété, cliquez sur le bouton Supprimer la propriété en regard de la propriété à supprimer.

source: Click the Save Properties button to save your changes.
fr: Pour enregistrer vos modifications, cliquez sur le bouton Enregistrer les propriétés .

source: File Level Notes
fr: Notes sur le fichier

source: To edit file-level notes, click on the Notes tab of the File Properties dialog. The dialog displays this view:
fr: Dans la boîte de dialogue Métadonnées du fichier , cliquez sur l’onglet Notes pour accéder aux notes relatives au fichier. La boîte de dialogue affiche alors les notes attachées au fichier.

source: Click the Add Note button to open a dialog for entering the text of the new note to be added.
fr: Pour ajouter une note, cliquez sur le bouton Ajouter une note , puis saisissez la note à ajouter.

source: Attributes
fr: les attributs,

source: If you want to remove notes from the list, click the corresponding Remove Note buttons ( ) on the leftmost column.
fr: Pour supprimer une note, cliquez sur le bouton Supprimer la note en regard de la note à supprimer.

source: Click the Save Notes button to save your changes.
fr: Pour enregistrer vos modifications, cliquez sur le bouton Enregistrer les notes .

source: Properties
fr: les propriétés,

source: Notes
fr: les notes.

source: To edit the metadata of the currently open TMX file, select File File Properties from the main menu or click on the File Properties button on the top toolbar.
fr: Pour éditer les métadonnées d’un fichier TMX, ouvrez-le, puis sélectionnez Fichier Métadonnées du fichier dans le menu (ou cliquez sur le bouton Métadonnées du fichier dans la barre d’outils).

source: File Level Attributes
fr: Attributs du fichier

source: To change the file-level attributes of the TMX file, adjust the text displayed in the text boxes, select the appropriate values from the drop-down selectors, and then click the Save Attributes button.
fr: Vous pouvez modifier les attributs du fichier TMX en changeant les valeurs dans les champs texte et dans les listes déroulantes, puis en cliquant sur le bouton Enregistrer les attributs .

source: Filter Translation Units
fr: Filtrer les unités de traduction

source: Follow these steps to filter units containing a given text or to display untranslated units.
fr: Voici les étapes à suivre pour n’afficher que les unités non traduites, ou celles contenant un texte donné.
